      * ESTE PROGRAMA LEE UNA CADENA DE TEXTO DE LA FICHA SYSIN DEL
      * JCL QUE LO LANZA Y LA IMPRIME POR LA SALIDA
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PRUEBA3.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 ENTRADA
            05 TEXTO.
               10 CTRL     PIC X.
               10 TXT      PIC X(50).
            05 I           PIC 99.

       PROCEDURE DIVISION.
            PERFORM 1000-INICIO.
            PERFORM 2000-PROCESO UNTIL CTRL EQUAL '%'.
            PERFORM 3000-FIN.

       1000-INICIO.
           INITIALIZE ENTRADA.
           DISPLAY 'EL TEXTO RECOCIGO DE LA CADEANA ES...'
       2000-PROCESO.
           ACCEPT TEXTO FROM SYSIN.
           DISPLAY ENTRADA.
       3000-FIN.
           STOP RUN.
