      * PROGRAMA QUE LEE DE UN FICHERO Y ESCRIBE EN SYSOUT
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PRUEBA6.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
            SELECT FICHERO-ENT ASSIGN TO ENTRADA
            ORGANIZATION IS SEQUENTIAL
            ACCESS IS SEQUENTIAL
            FILE STATUS IS FS-ESTADO.

       DATA DIVISION.
       FILE SECTION.
       FD FICHERO-ENT RECORDING MODE IS F
                      DATA RECORD IS REG-ENTRADA.

       01 REG-ENTRADA           PIC X(50).

       WORKING-STORAGE SECTION.
       01 FS-ESTADO             PIC 99.

       PROCEDURE DIVISION.
            PERFORM 1000-INICIO.
            PERFORM 2000-PROCESO UNTIL FS-ESTADO = 10.
            PERFORM 3000-FIN.

       1000-INICIO.
            OPEN INPUT FICHERO-ENT.
            READ FICHERO-ENT.

       2000-PROCESO.
            DISPLAY REG-ENTRADA.
            READ FICHERO-ENT.

       3000-FIN.
            CLOSE FICHERO-ENT.
            STOP RUN.
