      * PROGRAMA DE PRUEBA
      * BUCLES EN EL PARRAFO DE PROCESO
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PRUEBA5.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.
            PERFORM 1000-INICIO.
            PERFORM 2000-PROCESO 4 TIMES.
            PERFORM 3000-FIN.

       1000-INICIO.
       2000-PROCESO.
           PERFORM 2100-IMPRIME-TEXTO 2 TIMES.
       2100-IMPRIME-TEXTO.
           PERFORM 5 TIMES
           DISPLAY 'HOLA MUNDO'
           DISPLAY 'HOLA PEPE'
           END-PERFORM.
       3000-FIN.
           STOP RUN.
