      * PROGRAMA QUE LEE ARCHIVO Y ESCRIBE EN ARCHIVO SALIDA
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PRUEBA7.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
            SELECT FICHERO-ENT ASSIGN TO ENTRADA
            ORGANIZATION IS SEQUENTIAL
            ACCESS IS SEQUENTIAL
            FILE STATUS IS FS-ENTRADA.

            SELECT FICHERO-SAL ASSIGN TO SALIDA
            ORGANIZATION IS SEQUENTIAL
            ACCESS IS SEQUENTIAL
            FILE STATUS IS FS-SALIDA.

       DATA DIVISION.
       FILE SECTION.
       FD FICHERO-ENT RECORDING MODE IS F
                      DATA RECORD IS REG-ENTRADA.

       01 REG-ENTRADA           PIC X(50).

       FD FICHERO-SAL RECORDING MODE IS F
                      DATA RECORD IS REG-SALIDA.

       01 REG-SALIDA            PIC X(50).

       WORKING-STORAGE SECTION.
       01 FS-ENTRADA            PIC 99.
          88 FS-ENTRADA-OK           VALUE 00.
          88 FS-ENTRADA-FIN          VALUE 10.
       01 FS-SALIDA             PIC 99.

       PROCEDURE DIVISION.
            PERFORM 1000-INICIO.
            PERFORM 2000-PROCESO UNTIL FS-ENTRADA-FIN.
            PERFORM 3000-FIN.

       1000-INICIO.
            OPEN INPUT FICHERO-ENT.
            OPEN OUTPUT FICHERO-SAL.
            READ FICHERO-ENT.

       2000-PROCESO.
            MOVE REG-ENTRADA       TO REG-SALIDA.
            WRITE REG-SALIDA.
            READ FICHERO-ENT.

       3000-FIN.
            CLOSE FICHERO-ENT.
            CLOSE FICHERO-SAL.
            STOP RUN.
