      * ESTE PROGRAMA LEE UNA CADENA DE TEXTO DE LA FICHA SYSIN DEL
      * JCL QUE LO LANZA Y LA IMPRIME POR LA SALIDA
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PRUEBA3.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TEXTO PIC X(50).

       PROCEDURE DIVISION.
            PERFORM 1000-INICIO.
            PERFORM 2000-PROCESO.
            PERFORM 3000-FIN.

       1000-INICIO.
           ACCEPT TEXTO FROM SYSIN.
           DISPLAY 'EL TEXTO RECOCIGO DE LA CADEANA ES...'
       2000-PROCESO.
           DISPLAY TEXTO.
       3000-FIN.
           STOP RUN.
